In [1]:
import pandas as pd
import os.path as op

In [2]:
DATA_DIR = '../data/'

## Introduction

We prepare data for truth discovery problem. The following datasets will be considered:

- books
- flights
- weather
- population

## Datasets

### Stock

### Books

Noisy data

In [3]:
book_df = pd.read_csv(op.join(DATA_DIR, 'book/book.txt'),
                      header=None, sep='\t',
                      names=['online_store', 'isbn_10', 'book_name', 'book_authors'])

In [4]:
book_df.head()

,online_store,isbn_10,book_name,book_authors
0,eCampus.com,0201853949,"The art Of Computer Programming, Fascicle 3: G...",Not Available
1,Indoo.com,0201853949,"Art of Computer Programming, Volume 4, Fascicl...","Knuth, Donald E."
2,textbookxdotcom,0201853949,"The 'art Of Computer Programming, Fascicle 3 G...",NaN
3,A1Books,0201853949,"The Art of Computer Programming, Volume 4, Fas...","Knuth, Donald E."
4,textbooksNow,0201853949,Art of Computer Programming,Knuth

In [5]:
book_golden = pd.read_csv(op.join(DATA_DIR, 'book/book_golden.txt'),
                         header=None, sep='\t',
                         names=['isbn_10', 'book_authors'])

True data

In [6]:
book_golden.head()

         isbn_10                                       book_authors
0  9780073516677         o'leary, timothy j.;  o'leary, linda i.;
1  9780072999389                 yacht, carol ;  crosson, susan ;
2  9780072922363                                hutton, david v.;
3  9780072843996  haag, stephen ;  perry, james t.;  sosinsky, b...
4  9780072466850                                   reddy, j. n. ;

### Flights

In [7]:
flight_df = pd.read_csv(op.join(DATA_DIR, 'flights/claims/flights_claim1.csv'))

In [8]:
flight_df.head()

,ObjectID,PropertyID,PropertyValue,SourceID,TimeStamp
0,AA-1623-EWR-MIA2011-12-18,ActualDepartureTime,12/18/11 2:58 PM (-05:00),myrateplan,2011-12-18
1,AA-1623-EWR-MIA2011-12-18,ActualArrivalTime,12/18/11 5:14 PM (-05:00),myrateplan,2011-12-18
2,AA-1623-EWR-MIA2011-12-18,ActualDepartureTime,12/18/11 2:58 PM (-05:00),helloflight,2011-12-18
3,AA-1623-EWR-MIA2011-12-18,ActualArrivalTime,12/18/11 5:14 PM (-05:00),helloflight,2011-12-18
4,AA-1623-EWR-MIA2011-12-18,ActualDepartureTime,12/18/11 2:58 PM (-05:00),flytecomm,2011-12-18

We need to deal with time formatting here.

### Weather

In [9]:
weather_df = pd.read_csv(op.join(DATA_DIR, 'weather/claims/weather_claim1.csv'))

In [10]:
weather_df.head()

,ObjectID,PropertyID,PropertyValue,SourceID,TimeStamp
0,sanjosefrijan2908,Temperature,48,msn,fri jan 29 08:45:00 2010
1,sanjosefrijan2908,RealFeel,48,msn,fri jan 29 08:45:00 2010
2,sanjosefrijan2908,Humidity,87,msn,fri jan 29 08:45:00 2010
3,sanjosefrijan2908,Pressure,30.1,msn,fri jan 29 08:45:00 2010
4,sanjosefrijan2908,Visibility,10,msn,fri jan 29 08:45:00 2010

Again some time formatting need to be done here

### Population

In [11]:
population_df = pd.read_csv(op.join(DATA_DIR, 'population/population_claims.csv'))

In [12]:
population_df.head()

,ObjectID,PropertyID,PropertyValue,SourceID,TimeStamp
0,abu dhabi,Population2006,1000230,0 (68.162.248.83),NaN
1,abu dhabi,Population2006,1850230,1513217: Mohammedfairouz,NaN
2,amsterdam,Population2006,741329,141597: Ilse@,NaN
3,amsterdam,Population2006,742884,1300620: Krator,NaN
4,adelaide,Population2006,1124315,3922171: Pirate05,NaN

In [13]:
population_df.shape

(49955, 5)